#coding: cp1251

print('\n \
\033[35m\033[1m                                             Часто используемое\n \n \n \
\033[31m  #coding: cp1251 \033[37m - если нужно использовать русский язык\n \n \
\033[32m **\033[37m - возведение в степень \n \
\033[32m \\\033[37m - остаток от деления \n \
\033[32m %\033[37m - модуль \n \
\033[32m ==\033[37m - сравнение \n \
\033[32m !=\033[37m - неравенство \n \
\033[32m if():\033[37m - если (условие) \n \
\033[32m else:\033[37m - иначе \n \
\033[32m elif():\033[37m - иначе если (условие) \n \
\033[32m while():\033[37m - цикличное (условие) \n \
\033[32m break\033[37m - закончить цикл \n \
\033[35m                                           Цвета и эффекты текста \n \n \
\033[37m \\033 - Код перед цветом или эффектом \n \n \
\033[31m   Цвета:\n \n \
\033[37m [30m -\033[30m Чёрный\n \
\033[37m [31m -\033[31m Красный\n \
\033[37m [32m -\033[32m Зелёный\n \
\033[37m [33m -\033[33m Жёлтый\n \
\033[37m [34m -\033[34m Синий\n \
\033[37m [35m -\033[35m Фиолетовый \n \
\033[37m [36m -\033[36m Бирюзовый \n \
\033[37m [37m - Белый \n \n \
\033[31m   Эффекты: \n \n \
\033[37m\033[1m 0 -\033[0m Сброс \n \
\033[1m 1 - Жирный \n \
 2 -\033[2m Блёклый \n \
\033[0m\033[1m 3 -\033[3m Курсив \n \
\033[0m\033[1m 4 - \033[4mПодчёркнутый\033[0m \n \
\033[1m 5 -\033[5m Редкое мигание\033[0m \n \
')

